/*
************************************************************************
* file name: display.c
* author: 苏尚宇
* date: Mon Feb 13 20:23:19 CST 2023
* path: /mnt/e/Code/puresoft/project
* describe: NULL
************************************************************************
*/

#include "main.h"
#include "control.h"

/*
************************************************************************
* @brief      display_system()
* @param      void
* @return     void
* describe:   显示登录界面
************************************************************************
*/ 
void display_system(void)
{
	system("clear");
	printf("******************************\n");
	printf("*   欢迎使用文件云服务系统   *\n");
	printf("******************************\n");
	printf("*          请 选 择          *\n");
	printf("*          1、登 录          *\n");
	printf("*          2、注 册          *\n");
	printf("*          3、管理员         *\n");
	printf("*          4、退 出          *\n");
	printf("******************************\n");
	printf("请选择: ");
	// scanf("%d", &opt1);
}
/*
************************************************************************
* @brief      display_order()
* @param      void
* @return     void
* describe:   显示操作菜单
************************************************************************
*/ 
void display_order(void)
{
	system("clear");
	printf("******************************\n");
	printf("*   欢迎使用文件云服务系统   *\n");
	printf("******************************\n");
	printf("*      请     选     择      *\n");
	printf("*     1、查看共享文件夹      *\n");
	printf("*     2、查看私人文件夹      *\n");
	printf("*     3、退          出      *\n");
	printf("*     0、返          回      *\n");
	printf("******************************\n");
	printf("请选择: ");
	// scanf("%d", &opt2);
}
/*
************************************************************************
* @brief      display_choice_file()
* @param      void
* @return     void
* describe:   显示下载还是上传
************************************************************************
*/ 
void display_choice_file(void)
{
	printf("*************************************************************************\n");
	printf("请选择 1 下载文件 2 上传文件 0 返回: ");
	// scanf("%d", &opt3);
}
/*
************************************************************************
* @brief      display_admin()
* @param      void
* @return     void
* describe:   显示管理员界面
************************************************************************
*/ 
void display_admin(void)
{
	system("clear");
	printf("******************************\n");
	printf("*          请 选 择          *\n");
	printf("*        1、删除用户         *\n");
	printf("*        2、删除文件         *\n");
	printf("*        0、返    回         *\n");
	printf("******************************\n");
	printf("请选择: ");

}

